---
kind: property
id: P:Autodesk.Revit.DB.CylindricalSurface.XDir
source: html/6a22ae33-ce30-36e9-6c71-b1a9cb50e858.htm
---
# Autodesk.Revit.DB.CylindricalSurface.XDir Property

X axis of the local coordinate system associated with this cylinder.

## Syntax (C#)
```csharp
public XYZ XDir { get; }
```